'use strict'

//Умова: Дано інформацію про прибуток К магазинів протягом тижня. Упорядкувати тижні (рядки) за спаданням суми елементів у рядку (тобто при порівнянні двох рядків треба знайти суму кожного з рядків і порівнювати ці суми, на основі цих сум буде зрозуміло, який з елементів повинен іти раніше).

if (confirm(`Shall we start the test?`)) {
   let income = [
      [12, 87, 45, 63, 99, 34, 76], //416
      [54, 23, 78, 11, 435, 65, 32], //698
      [44, 98, 21, 56, 77, 88, 200] // 584
   ]
   let getSum = (arr) => arr.reduce((sum, num) => sum + num, 0);

   income.sort((day1, day2) => getSum(day2) - getSum(day1));

   document.write(income);
}