'use strict'

//Умова: Дано інформацію про прибуток К магазинів протягом тижня. Знайти: Сформувати загальний список (одновимірний масив) зі значенням, які що більші за 200.

if (confirm(`Shall we start the test?`)) {
   let income = [
      [12, 87, 45, 63, 99, 34, 76],
      [54, 23, 78, 11, 435, 65, 32],
      [44, 98, 21, 56, 77, 88, 200],
      [72, 39, 300, 85, 67, 41, 53],
      [94, 26, 37, 82, 31, 47, 69],
      [59, 14, 62, 95, 27, 756, 49],
      [33, 432, 55, 100, 8, 42, 16],
      [66, 89, 3, 74, 654, 50, 61]
   ]
   let incomeMoreThan200 = income.flat(Infinity).filter(el => el > 200)
   document.write(`Income which is more than 200 is: ${incomeMoreThan200}`)
}
