'use strict'

//Умова: Дано інформацію про прибуток К магазинів протягом тижня. Відсортувати тижні (рядки) за спаданням максимального елемента у цьому тижні (рядку), тобто при порівнянні рядків потрібно порівнювати максимальні елементи у кожному з цих рядків.

if (confirm(`Shall we start the test?`)) {
   let income = [
      [12, 87, 45, 63, 99, 34, 76],
      [54, 23, 78, 11, 435, 65, 32],
      [44, 98, 21, 56, 77, 88, 200]
   ]
   const getMax = (arr) => Math.max(...arr);
   income.sort((day1, day2) => getMax(day2) - getMax(day1))
   document.write(income)
}